Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K46B.tmx
Source language: en_us
Languages: zh_cn

source: Vigil
zh_cn: 祈祷（一）

source: It was the Holy Night vigil, Wigilia, which means in Polish "to watch," as the Three Kings from Orient watched the rising of the Star, as the shepherds, gathered in the cold, watched and waited the birth of a babe in a manger, a birth from which the world and time would begin anew.
zh_cn: 平安夜的祈祷在波兰语中用wigilia表示，是“观看”的意思。三位来自东方的国王审视着一颗星辰的升起，天寒地冻中羊倌们聚拢一团，他们翘首等待，等待马槽里一位婴儿的出世，此后整个世界和时间都会重新来过。

source: And I watched and waited too.
zh_cn: 我也眼巴巴盼着自己的。

source: My empty stocking dangled above the space heater from a clothesline shimmering with silver icicles.
zh_cn: 晶莹的冰条垂在晾绳上一闪一闪，绳下是暖气，绳上挂着我那空空的长桶袜。

source: The colors of the bubble lights on our tree boiled across the steamy windowpanes, while outside, a snowfall that seemed conjured up by my father's spirited reading of "The Night Before Christmas" settled on a deserted 18th Street.
zh_cn: 在家里，树上泡泡灯溢出的色彩穿透水汽蒙蒙的玻璃窗，不住地翻腾；屋外雪花飘落，它们仿佛被爸爸深情朗读的“圣诞前夜”施了魔法般纷纷涌出，第十八街区无人经过的街上，雪堆了起来。

source: I was in my flannel pajamas, ready for bed, when a knock came at the door.
zh_cn: 我穿着棉绒睡衣正要休息，这时门外响起了一阵敲门声。

source: Although our holiday decorations included an extra plate set at the straw-strewn dining-room table for any stranger who might arrive, my parents weren't expecting company.
zh_cn: 饭厅的桌上散落着麦杆，还有一份额外的餐盘，这是爸爸妈妈备下的，用来招待任何可能上门的生人，他们没料想真有人来。

source: My father glanced at my mother and shrugged, but for once he didn't ask who before unchaining the safety latch.
zh_cn: 爸爸耸耸肩，扫了眼妈妈，平生头一遭他没先问是谁就解开了安全闩。

source: The door opened on the bespectacled face of the grizzled, spooky old Bohemian from the taxidermy shop downstairs.
zh_cn: 门外头的人戴副眼镜，头发花白，形同幽灵，是楼下开店铺的捷克老爷爷，专卖动物标本的。

source: He stood cradling what looked to be an enormous, misshapen gift.
zh_cn: 他站在那儿，手里的礼物看着又大又怪。

source: It was wrapped in newspaper bound with green plastic clothesline, and my father's first instinct was to politely refuse it.
zh_cn: 那东西用报纸包着，还捆有绿色的塑料晾绳，所以爸爸的第一反应是婉言谢绝。

source: "Stashu, tell him to come in and have some eggnog," my mother said.
zh_cn: “斯坦苏，请他进来喝点蛋酒吧。”妈妈说。

source: But the old Bohemian wouldn't step from the hall.
zh_cn: 年迈的捷克人不愿踏入门厅。

source: He hadn't come to disturb us with a visit, only to deliver his package, which he finally managed to press into my father's arms.
zh_cn: 他来了却不扰我们，只递上他的包裹，最终成功地把它塞进了爸爸的手膀。

source: Pan, come in and join us and break oplatki for health in the new year," my mother called.
zh_cn: “pan,进来和我们一起掰薄饼吧，为来年的健康祈福。”妈妈喊到。

source: Traditionally on Wigilia, a white wafer of oplatki was passed around the table, as we had earlier that evening, and each person broke off a piece and made a wish for the coming year.
zh_cn: 按习俗在平安夜这天，餐桌旁的人要依次传递一种象征圣饼的白色薄脆饼干，就是今天早些时候我们拿的那种，每人掰下一块来许下新年的愿望。

source: Oplatki - Angel Bread - melted like a wheaty snowflake on the tongue.
zh_cn: 薄脆饼——天使之饼——就像麦色的雪片在舌尖融化。

source: I was told it tasted like the Host did at Mass, something I was too young to know, as I was still a year away from my First Communion.
zh_cn: 他们告诉我说饼干就像做弥撒时圣体的味道，我年纪太小，离初次圣礼还差一年，这些话我还听不懂。

source: My mother always addressed the old man as Pan - "Mister," in Polish.
zh_cn: 妈妈一直称呼这位老爷爷pan——波兰语里”先生“的意思。

source: I don't think she knew his name.
zh_cn: 我想妈妈不知道他的名字。

source: His taxidermy shop was nameless too.
zh_cn: 他的标本商店也没有名字。

source: Earlier that day, when she'd taken me with her to drop off a paper plate of Russian tea balls at his shop because he was alone at Christmas, I'd told her that kids said he'd escaped from the booby hatch.
zh_cn: 因为他一个人过圣诞，所以这天早些时候，妈妈拿纸盘装了一盘子俄罗斯的过滤茶球，带我一块儿去搁到店里，我告诉妈妈，小朋友说他是从疯人院逃出来的。

source: "He came from the Old Country during the War," my mother said. "He came alone because they left him nothing.
zh_cn: ”那时他的故乡正打仗，才来到这里。”妈妈说：“他的亲人死后没有留下任何东西，所以就他一个人来这儿。

source: We can't imagine what he's lived through.
zh_cn: 我们没法想像他都经受过什么。

source: Never forget how blessed we are."
zh_cn: 永远别忘了我们是多么幸福。”

source: Now that he'd delivered the gift he'd lugged up four dim-lit flights of stairs, the old man refused any further obligation.
zh_cn: 老人吃力地拽着礼物上了四层楼，这会儿礼也送了，他却不愿接受更多的恩惠。

source: "No, no, enough, Missus, dekuji, dekuji," he said, bowing with thanks while edging away from our door.
zh_cn: “不了，不了，这样就够了，谢谢太太，谢谢。”他一边鞠躬一边侧身离开了。

source: My parents bowed back, wishing him Wesolych Swiat, and he wished us Merry Christmas in Czech in return.
zh_cn: 爸爸妈妈也鞠躬，祝愿他圣诞快乐，他用捷克语回敬我们。

source: His spectacles flashed a last gleam before he disappeared into the cavernous hallway.
zh_cn: 老人的身影消失进门厅的一刹那，他眼镜的镜片闪过最后一丝微光。

source: My father shouldered the door shut and carried the gift to our kitchen table.
zh_cn: 爸爸用肩抵上门，然后把礼物抱到厨房的桌上。

source: "Oh my God," my mother said.
zh_cn: “我的天。”妈妈说。

source: She snipped the knotted line with her sewing shears and they began to unwrap the newspaper.
zh_cn: 她先用缝纫用的大剪子剪开了打结的绳子，然后和爸爸一起拆报纸。

source: The top sheets peeled off easily, but each layer of newspaper was increasingly damp.
zh_cn: 面上的报纸容易剥，越往里越润湿。

source: When the wet, pulpy sheets shredded in his hands, my father resorted to the spatula he used for flipping pancakes.
zh_cn: 爸爸借翻炒煎饼用的小铲子把浸成浆糊的纸张撕下来。
